InformationRegisters/сабИсторияИзмененийПлатежногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>сабИсторияИзмененийПлатежногоКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействияПриИзмененииПлатежногоКалендаря</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сабДействияПриИзмененииПлатежногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/сабИсторияИзмененийПлатежногоКалендаря/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(ДатаДействия,Пользователь,ДействияПриИзмененииПлатежногоКалендаря,Документ,Сумма,Дополнительно) Экспорт
	МенеджерЗаписи = РегистрыСведений.сабИсторияИзмененийПлатежногоКалендаря.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаДействия = ДатаДействия;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.ДействияПриИзмененииПлатежногоКалендаря = ДействияПриИзмененииПлатежногоКалендаря;
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Сумма = Сумма;
	МенеджерЗаписи.Дополнительно = Дополнительно;
	МенеджерЗаписи.Записать();
КонецПроцедуры
